{
    "name": "Ankit Tandon",
    "title": "Certified Google Cloud Java Full Stack Developer",
    "contact": {
      "location": "Noida, Uttar Pradesh",
      "phone": "+91 85739 0766",
      "email": "ankit.me7@gmail.com",
      "linkedin": "http://linkedin.com/in/ankittandonn"
    },
    "summary": "Certified Google Cloud Platform Associate Cloud Engineer with expertise in cloud-native solutions and modern DevOps practices. Experienced in leveraging tools like Docker, Kubernetes, and Helm to optimize application deployment, reducing setup time by 35% in production environments. Dynamic Java Developer with over 3 years of expertise in designing and deploying scalable, cloud-native applications. Proficient in Java 8, 11, and 17, with hands-on expertise in Spring Boot and CI/CD pipelines, driving automation to accelerate software delivery by 30%. Skilled in implementing automated testing frameworks to ensure maintainable, high-quality code.",
    "experience": [
      {
        "company": "IRIS SOFTWARE",
        "role": "Software Engineer",
        "location": "Noida, Uttar Pradesh",
        "period": "April 2022 - Present",
        "projects": [
          {
            "name": "Think or Swim - Cloud Migration",
            "client": "Charles Schwab",
            "period": "March 2024 - Present",
            "achievements": [
              "Led the migration of 30+ applications to Kubernetes, designing tailored Helm charts and reducing setup time by 35%.",
              "Spearheaded the creation of Docker images tailored to application requirements, reducing resource consumption by 70%.",
              "Developed and maintained Helm charts for Kubernetes, simplifying deployment processes and reducing setup time by 35%.",
              "Troubleshot performance issues, identifying bottlenecks that reduced application latency by 25%.",
              "Built and optimized CI/CD pipelines using TeamCity and Git, reducing deployment time by 30% across cloud environments."
            ]
          },
          {
            "name": "Think or Swim – Metrics Migration",
            "client": "Charles Schwab",
            "period": "January 2023 - February 2024",
            "achievements": [
              "Oversaw the migration of the metrics system from an in-house MARS (Monitoring And Reporting System) to Prometheus & Grafana, enhancing real-time visibility and alerting capabilities.",
              "Integrated Prometheus metrics with Grafana, building a dashboard to monitor live server status for ThinkorSwim applications.",
              "Established real-time alerting mechanisms in Prometheus, reducing response time to incidents by 25% and minimizing system downtime.",
              "Conducted rigorous testing and data validation to confirm accuracy, enhancing management’s ability to monitor performance."
            ]
          },
          {
            "name": "Back Office Cash Application Migration",
            "client": "TD Ameritrade",
            "period": "April 2022 - December 2022",
            "achievements": [
              "Led development and migration for the Back Office Cash Application, responsible for transactional data handling across Trade, Wire, Tax Payments, Internal Transfers, and ACH transactions.",
              "Developed Spring Batch jobs and leveraged PostgreSQL to orchestrate data extraction, transformation, and migration, improving data handling efficiency by 35%.",
              "Implemented complex business rules and optimized batch processes using PostgreSQL features to ensure accuracy and reliability of transactional data.",
              "Migrated 50M account records to a PostgreSQL-based platform, achieving 99.98% accuracy through automated Spring Batch jobs and reconciliation processes.",
              "Diagnosed and resolved performance bottlenecks, reducing application latency by 25% through database indexing and query optimization in PostgreSQL.",
              "Verified data integrity through reconciliation processes and cross-checked thousands of records in PostgreSQL to confirm successful migration."
            ]
          }
        ]
      }
    ],
    "education": [
      {
        "institution": "Dr. A.P.J. Abdul Kalam Technical University",
        "degree": "Master of Business Administration in Information Technology",
        "period": "August 2018 - July 2020"
      },
      {
        "institution": "Dr. A.P.J. Abdul Kalam Technical University",
        "degree": "Bachelor of Technology in Computer Science & Engineering",
        "period": "August 2014 - July 2018"
      }
    ],
    "skills": {
      "cloud": ["Docker", "Kubernetes", "Helm", "Podman"],
      "java": ["Java 8", "Java 11", "Java 17"],
      "spring_framework": ["Spring Boot", "Spring Cloud", "Spring Security"],
      "database": ["Postgres", "MySQL"],
      "tools": ["Git", "IntelliJ", "TeamCity", "SonarLint", "Harbor", "Harness"],
      "monitoring_and_logging": ["Prometheus", "Grafana", "Loki", "Fluentd/Fluent Bit"]
    },
    "certifications": [
      {
        "name": "Associate Cloud Engineer",
        "issuer": "Google Cloud",
        "link": "https://www.credly.com/badges/f081c094-90ad-48c0-b695-5d106cec5cd3/public_url"
      }
    ],
    "languages": ["German", "English", "Hindi"]
  }

  